In [9]:
import pandas as pd

시리즈

In [2]:
dict_data = {'a':1,'b':2,'c':3,'d':4}

In [13]:
sr = pd.Series(dict_data)
print(type(sr))
print(sr)

<class 'pandas.core.series.Series'>
c0       [1, 2, 3]
c1       [4, 5, 6]
c2       [7, 8, 9]
c3    [10, 11, 12]
c4    [13, 14, 15]
dtype: object

데이터프레임

In [10]:
import pandas as pd
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data)

In [11]:
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [38]:
import pandas as pd
df = pd.DataFrame([[15,'남','덕영중'], [17,'여','탄방중']], 
                 index = ['김영인', '한동훈'],
                 columns = ['나이', '성별', '학교'])
print(df)
print('\n')
print(df.index)
print('\n')
print(df.columns)
df.index = ['학생1', '학생2']
df.columns = ['연령','남녀','소속']
print('\n')
print('컬럼 인덱스 변경후')
print('\n')
print(df)
print('=========================')
print('\n')
# rename 메소드 사용하기
print('rename 메소드 사용하기')
print(df)
print('\n')
# rename 사용 후
df.rename(columns={'연령':'나이', '남녀':'성별', '소속':'학교이름'}, inplace = True)
df.rename(index={'학생1':'김영인', '학생2':'한동훈'})
print(df)

df

     나이 성별   학교
김영인  15  남  덕영중
한동훈  17  여  탄방중


Index(['김영인', '한동훈'], dtype='object')


Index(['나이', '성별', '학교'], dtype='object')


컬럼 인덱스 변경후


     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  탄방중
=========================


rename 메소드 사용하기
     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  탄방중


     나이 성별 학교이름
학생1  15  남  덕영중
학생2  17  여  탄방중

     나이 성별 학교이름
학생1  15  남  덕영중
학생2  17  여  탄방중

In [50]:
# drop 메소드 사용하기
import pandas as pd
exam_data = {'수학':[90,80,70], '영어':[98,89,95], '음악':[99,88,77], '체육':[100,95,90] }
df= pd.DataFrame(exam_data, index = ['서준', '동훈', '영인'])
print(df)
print('\n')

df2 = df[:]
df2.drop('동훈', inplace=True)
print(df2)
print('\n')

df3 = df[:]
df3.drop(['동훈','영인'], axis=0, inplace = True)
print(df3)
print('\n')
print(df)
print('\n')
df.drop('수학',axis=1,inplace=False)

    수학  영어  음악   체육
서준  90  98  99  100
동훈  80  89  88   95
영인  70  95  77   90


    수학  영어  음악   체육
서준  90  98  99  100
영인  70  95  77   90


    수학  영어  음악   체육
서준  90  98  99  100


    수학  영어  음악   체육
서준  90  98  99  100
동훈  80  89  88   95
영인  70  95  77   90

C:\Users\toyou\anaconda3\lib\site-packages\pandas\core\frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(
C:\Users\toyou\anaconda3\lib\site-packages\pandas\core\frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

    영어  음악   체육
서준  98  99  100
동훈  89  88   95
영인  95  77   90

In [56]:
import pandas as pd 
exam_data = {'수학':[90,80,70], '영어':[98,89,95], '음악':[99,88,77], '체육':[100,95,90] }
df= pd.DataFrame(exam_data, index = ['서준', '동훈', '영인'])
print(df)
print('\n')
label1 = df.loc['서준']
positional = df.iloc[0]
print(label1)
print('\n')
print(positional)
#여기서는 iloc 와 loc의 차이가 없다.

    수학  영어  음악   체육
서준  90  98  99  100
동훈  80  89  88   95
영인  70  95  77   90


수학     90
영어     98
음악     99
체육    100
Name: 서준, dtype: int64


수학     90
영어     98
음악     99
체육    100
Name: 서준, dtype: int64

In [59]:
df['수학'] # 시리즈 반환
#[['']]부터 데이터 프레임으로 반환
df[['수학']]

    수학
서준  90
동훈  80
영인  70

In [64]:
import pandas as pd 
exam_data = {'이름':['서준', '동훈', '영인'], '수학':[90,80,70], '영어':[98,89,95], '음악':[99,88,77], '체육':[100,95,90] }
df = pd.DataFrame(exam_data)

#set_index 메소드 사용하기
df.set_index('이름', inplace=False)
df
# set_index 활용법!!!!

   이름  수학  영어  음악   체육
0  서준  90  98  99  100
1  동훈  80  89  88   95
2  영인  70  95  77   90

In [65]:
df.set_index('수학', inplace=True)
df

    이름  영어  음악   체육
수학
90  서준  98  99  100
80  동훈  89  88   95
70  영인  95  77   90

열 추가

In [69]:
import pandas as pd 
exam_data = {'수학':[90,80,70], '영어':[98,89,95], '음악':[99,88,77], '체육':[100,95,90] }
df= pd.DataFrame(exam_data, index = ['서준', '동훈', '영인'])
df['국어'] = 90
df

    수학  영어  음악   체육  국어
서준  90  98  99  100  90
동훈  80  89  88   95  90
영인  70  95  77   90  90

행 추가

In [78]:
import pandas as pd 
exam_data = {'수학':[90,80,70], '영어':[98,89,95], '음악':[99,88,77], '체육':[100,95,90] }
df= pd.DataFrame(exam_data, index = ['서준', '동훈', '영인'])
df.loc['민섭'] = [90, 80, 90, 100]
df

    수학  영어  음악   체육
서준  90  98  99  100
동훈  80  89  88   95
영인  70  95  77   90
민섭  90  80  90  100

원소 값 변경

In [80]:
import pandas as pd 
exam_data = {'수학':[90,80,70], '영어':[98,89,95], '음악':[99,88,77], '체육':[100,95,90] }
df= pd.DataFrame(exam_data, index = ['서준', '동훈', '영인'])
df.loc['동훈',['수학','영어','음악','체육']] = 100
df

     수학   영어   음악   체육
서준   90   98   99  100
동훈  100  100  100  100
영인   70   95   77   90

행, 열의 위치 바꾸기

In [83]:
import pandas as pd 
exam_data = {'수학':[90,80,70], '영어':[98,89,95], '음악':[99,88,77], '체육':[100,95,90] }
df= pd.DataFrame(exam_data, index = ['서준', '동훈', '영인'])
df.T

     서준  동훈  영인
수학   90  80  70
영어   98  89  95
음악   99  88  77
체육  100  95  90

시리즈 vs 시리즈 연산

In [85]:
import pandas as pd
import numpy as np

student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어': 90})

print(student1)
print('\n')
print(student2)
print('\n')

sr_add = student1.add(student2, fill_value=0) #덧셈
sr_sub = student1.sub(student2, fill_value=0) #뺄셈
sr_mul = student1.mul(student2, fill_value=0) #곱셈
sr_div = student1.div(student2, fill_value=0) #나눗셈

result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div], 
                     index = ['뎃셈','뺄셈','곱셈','나눗셈'])

print(result)
# 판다스에서는 자동적으로 같은 컬럼을 매치하여 연산결과를 한다. 같은 컬럼이 없으면, nan값으로 반영한다.

국어     NaN
영어    80.0
수학    90.0
dtype: float64


수학    80
국어    90
dtype: int64


       국어        수학    영어
뎃셈   90.0   170.000  80.0
뺄셈  -90.0    10.000  80.0
곱셈    0.0  7200.000   0.0
나눗셈   0.0     1.125   inf

데이터프레임 vs 데이터 프레임 연산

In [88]:
import pandas as pd
import seaborn as sns

#titanic에서 자료 가져오기

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
print(df.tail())
print('\n')
print(type(df))
print('\n')

# 데이터프레임에 숫자 10 더하기
addition = df + 10
print(addition.tail())
print('\n')
print(type(addition))
print('\n')

# 데이터프레임끼리 연산하기(addition - df)
subtraction = addition - df
print(subtraction.tail())
print('\n')
print(type(subtraction))

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75


<class 'pandas.core.frame.DataFrame'>


      age   fare
886  37.0  23.00
887  29.0  40.00
888   NaN  33.45
889  36.0  40.00
890  42.0  17.75


<class 'pandas.core.frame.DataFrame'>


      age  fare
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0


<class 'pandas.core.frame.DataFrame'>